#include "stdafx.h"
#include "Define.h"

int chName[CHARACTER_SIZE]	  = { 130, 131, 132, 133 };																				//BAZZI,KEPHI,MARID,UNI
int chLocation[4][2]		  = { { START_XLOCATION, START_YLOCATION },																		//캐릭터 위치(4꼭지점)
								  { START_XLOCATION + (MAP_XSIZE - 1)*MAP_XSPACE, START_YLOCATION },
								  { START_XLOCATION, START_YLOCATION + (MAP_YSIZE - 1)*MAP_YSPACE },
								  { START_XLOCATION + (MAP_XSIZE - 1)*MAP_XSPACE, START_YLOCATION + (MAP_YSIZE - 1)*MAP_YSPACE } };	
int balloonName[BALLOON_SIZE] = { 135, 136 };			//기본,레드

int itemName[ITEM_SIZE]		  = { 138, 139, 140 };		//풍선,물약,롤러

int brickName[BRICK_SIZE]	  = { 141, 142 };			    //스태틱 블럭, 탑 블럭

int BalloonUp[8][2]			  = { { 21, 247 }, { 79, 247 }, { 138, 247 }, { 195, 247 },														//물풍선 이미지 위쪽 좌표 
						          { 21, 87 }, { 79, 87 }, { 138, 87 }, { 195, 87 } };														//물풍선 이미지 위쪽 가장자리 좌표
int BalloonDown[8][2]		  = { { 21, 322 }, { 79, 322 }, { 138, 322 }, { 195, 322 },														//물풍선 이미지 아래쪽 좌표 
								  { 21, 163 }, { 79, 163 }, { 138, 163 }, { 195, 87 } };													//물풍선 이미지 아래쪽 가장자리 좌표
int BalloonLeft[8][2]		  = { { 264, 321 }, { 318, 321 }, { 372, 321 }, { 437, 321 },													//물풍선 이미지 왼쪽 좌표 
								  { 265, 162 }, { 327, 162 }, { 377, 162 }, { 429, 162 } };													//물풍선 이미지 왼쪽 가장자리 좌표 
int BalloonRight[8][2]		  = { { 264, 246 }, { 329, 246 }, { 383, 246 }, { 440, 246 },													//물풍선 이미지 오른쪽 좌표 
								  { 269, 88 }, { 328, 88 }, { 387, 88 }, { 442, 88 } };													    //물풍선 이미지 오른쪽 가장자리 좌표 
int BalloonCenter[3][2]		  = { { 21, 16 }, { 79, 16 }, { 138, 16 } };																	//물풍선 이미지 중앙 좌표

int Map[MAP_YSIZE][MAP_XSIZE] = { { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },															//물풍선 -> 1
							  	  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },															//터지는 물풍선 -> 2
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },															//풍선 -> 3
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },                                                         //물약 -> 4
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },                                                         //롤러 -> 5
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, },
								  { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, }, };

int aniArr[WAVE_ANI_SIZE] = { 3, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3 };

int temp[30] = { 0, };